Repository: Miocasa/Mentora
Catalog: assets/l10n/app_*.arb
Languages: ru

# tabHome
source: Home
ru: Главная

# tabMyCourses
source: My Courses
ru: Мои курсы

# tabProfile
source: Profile
ru: Профиль

# loginTitle
source: Welcome Back!
ru: С возвращением!

# loginSubtitle
source: Please sign in to continue
ru: Пожалуйста, войдите, чтобы продолжить

# loginEmailError
source: Please enter a valid email
ru: Пожалуйста, введите корректный email

# loginPasswordLabel
source: Password
ru: Пароль

# loginPasswordHint
source: Enter your password
ru: Введите пароль

# loginPasswordError
source: Please enter your password
ru: Пожалуйста, введите пароль

# loginForgotPassword
source: Forgot Password?
ru: Забыли пароль?

# loginForgotPasswordClicked
source: Forgot Password clicked!
ru: Кнопка восстановления пароля нажата!

# loginButton
source: Login
ru: Войти

# loginNoAccount
source: Don't have an account?
ru: Нет аккаунта?

# loginSignUpLink
source: Sign Up
ru: Зарегистрироваться

# loginFailed
source: Login failed. Check your credentials.
ru: Не удалось войти. Проверьте логин и пароль.

# signUpTitle
source: Create Account
ru: Создать аккаунт

# signUpSubtitle
source: Join us by filling out the form below
ru: Присоединяйтесь, заполнив форму ниже

# signUpNicknameLabel
source: Nickname
ru: Никнейм

# signUpNicknameHint
source: Your nickname
ru: Ваш никнейм

# signUpNicknameErrorEmpty
source: Please enter a valid name
ru: Пожалуйста, введите корректное имя

# signUpEmailError
source: Please enter a valid email
ru: Пожалуйста, введите корректный email

# signUpPasswordLabel
source: Password
ru: Пароль

# signUpPasswordHint
source: Create a strong password
ru: Создайте надёжный пароль

# signUpPasswordErrorEmpty
source: Please enter a password
ru: Пожалуйста, введите пароль

# signUpPasswordErrorShort
source: Password must be at least 6 characters
ru: Пароль должен быть не менее 6 символов

# signUpConfirmPasswordLabel
source: Confirm Password
ru: Подтвердите пароль

# signUpConfirmPasswordHint
source: Re-enter your password
ru: Повторно введите пароль

# signUpConfirmPasswordErrorEmpty
source: Please confirm your password
ru: Пожалуйста, подтвердите пароль

# signUpConfirmPasswordErrorNotMatch
source: Passwords do not match
ru: Пароли не совпадают

# signUpButton
source: Sign Up
ru: Зарегистрироваться

# signUpAlreadyHaveAccount
source: Already have an account?
ru: Уже есть аккаунт?

# signUpLoginLink
source: Login
ru: Войти

# signUpFailed
source: Sign up failed. Please try again or use a different email.
ru: Не удалось создать аккаунт. Попробуйте ещё раз или используйте другой email.

# signUpSuccess
source: Account created successfully! Please log in.
ru: Аккаунт успешно создан! Пожалуйста, войдите.

# homeSearchHint
source: Search courses...
ru: Поиск курсов...

# homeSearchCloseTooltip
source: Close Search
ru: Закрыть поиск

# homeSearchClearTooltip
source: Clear Search
ru: Очистить поиск

# homeSearchTooltip
source: Search Courses
ru: Поиск курсов

# homeSettingsTooltip
source: Settings
ru: Настройки

# homeNoCourses
source: No courses available. Try adding sample data.
ru: Нет доступных курсов. Попробуйте добавить тестовые данные.

# homeNoCoursesForQuery
source: No courses found for "{query}".
ru: По запросу "{query}" курсов не найдено.

# homeTryDifferentTerm
source: Try a different search term.
ru: Попробуйте изменить поисковый запрос.

# homeSampleDataLabel
source: Sample Data
ru: Тестовые данные

# homeLearningProgressTitle
source: Learning progress
ru: Прогресс обучения

# homeInnerProgressLabel
source: {days} days streak
ru: {days} дн. стрика

# homeOuterProgressLabel
source: Points: {points}
ru: Очки: {points}

# homeTodayPoints
source: Points for today
ru: Очки за сегодня

# homeStreakDays
source: Streak days
ru: Дни стрика

# homeStatusDone
source: Congrats, you have completed your study plan!🎉
ru: Поздравляем, ты выполнил план учёбы!🎉

# homeStatusAlmost
source: You are almost at your goal 👍
ru: Вы почти достигли цели 👍

# homeStatusFewLessons
source: Just a few more lessons 👾
ru: Ещё пару уроков 👾

# homeStatusGoodStart
source: Good start 🤠
ru: Хорошее начало 🤠

# homeStatusStart
source: Time to start 😸
ru: Пора начать 😸

# myCoursesLoginToSee
source: Please log in to see your courses.
ru: Пожалуйста, войдите, чтобы увидеть ваши курсы.

# myCoursesErrorWithReason
source: Error: {reason}
ru: Ошибка: {reason}

# myCoursesEmptyTitle
source: You are not enrolled in any courses yet.
ru: Вы ещё не записаны ни на один курс.

# myCoursesEmptySubtitle
source: Explore available courses and start learning!
ru: Изучите доступные курсы и начните обучение!

# courseEnrollmentLoginRequired
source: Please log in to enroll and view lessons.
ru: Пожалуйста, войдите, чтобы записаться и просматривать уроки.

# courseLessonsTitle
source: Lessons
ru: Уроки

# courseNoLessons
source: No lessons available for this course yet.
ru: Для этого курса ещё нет уроков.

# courseLoginToAccessLessons
source: Log in to enroll and access lessons.
ru: Войдите, чтобы записаться и получить доступ к урокам.

# courseEnrollToViewLessons
source: Enroll in the course to view lessons.
ru: Запишитесь на курс, чтобы просматривать уроки.

# coursePleaseEnrollToWatchLesson
source: Please enroll to watch this lesson.
ru: Пожалуйста, запишитесь на курс, чтобы посмотреть этот урок.

# coursePleaseEnrollToViewContent
source: Please enroll to view lesson content.
ru: Пожалуйста, запишитесь на курс, чтобы просматривать содержание урока.

# courseLoading
source: Loading...
ru: Загрузка...

# courseNotFound
source: Course not found or error loading.
ru: Курс не найден или произошла ошибка при загрузке.

# courseInstructor
source: Instructor: {name}
ru: Инструктор: {name}

# courseConfirmUnenrollTitle
source: Confirm Unenrollment
ru: Подтвердите отписку

# courseConfirmUnenrollBody
source: Are you sure you want to unenroll from "{title}"? Your progress will be lost.
ru: Вы уверены, что хотите отписаться от курса "{title}"? Ваш прогресс будет потерян.

# courseDialogCancel
source: Cancel
ru: Отмена

# courseDialogUnenroll
source: Unenroll
ru: Отписаться

# courseUnenrollSuccess
source: Successfully unenrolled!
ru: Вы успешно отписались!

# courseEnrollSuccess
source: Successfully enrolled!
ru: Вы успешно записались!

# courseEnrollErrorWithReason
source: Error: {reason}
ru: Ошибка: {reason}

# courseButtonUnenroll
source: Unenroll from Course
ru: Отписаться от курса

# courseButtonEnroll
source: Enroll in Course
ru: Записаться на курс

# courseCardCompleted
source: Completed
ru: Завершён

# courseCardViewCourse
source: View Course
ru: К курсу

# courseCardTapForDetails
source: Tap to view details
ru: Нажмите, чтобы посмотреть детали

# settingsTitle
source: Settings
ru: Настройки

# settingsConfirmLogoutTitle
source: Confirm Logout
ru: Подтвердите выход

# settingsConfirmLogoutBody
source: Are you sure you want to log out?
ru: Вы уверены, что хотите выйти?

# settingsCancel
source: Cancel
ru: Отмена

# settingsLogout
source: Log Out
ru: Выйти

# settingsAppearanceSection
source: Appearance
ru: Оформление

# settingsLightMode
source: Light Mode
ru: Светлая тема

# settingsDarkMode
source: Dark Mode
ru: Тёмная тема

# settingsSystemMode
source: System Default
ru: Системная тема

# settingsPrimaryColorSection
source: Primary Color
ru: Основной цвет

# settingsPrimaryColorHint
source: Select your preferred app color:
ru: Предпочитаемый цвет интерфейса:

# settingsAccountSection
source: Account
ru: Аккаунт

# settingsAboutSection
source: About
ru: О приложении

# settingsAboutAppTitle
source: About App
ru: О приложении

# settingsAboutAppSubtitle
source: Version {reason}
ru: Версия {reason}

# settingsAboutAppDescription
source: This is a great course application built with Flutter and accessible for everyone.
ru: Это отличное приложение для курсов, созданное на Flutter и доступное всем.

# settingsLogoutFailedWithReason
source: Logout failed: {reason}
ru: Не удалось выйти: {reason}

# profileLoginToSee
source: Please log in to see your profile.
ru: Пожалуйста, войдите, чтобы увидеть профиль.

# profileLoadErrorWithReason
source: Error loading profile: {reason}
ru: Ошибка загрузки профиля: {reason}

source: Profile not found.
ru: Профиль не найден.

# profileNameNotSet
source: Name not set
ru: Имя не задано

# profileStreakChip
source: {days, plural, one {# day streak} other {# days streak}}
ru: {days, plural, one {# день стрика} few {# дня стрика} many {# дней стрика} other {# дней стрика}}

# profileEditSoon
source: Profile editing will be available soon
ru: Редактирование профиля скоро будет доступно

# markdownLoadError
source: Failed to load document
ru: Не удалось загрузить документ

# markdownTocUnavailable
source: Table of contents is not available
ru: Оглавление недоступно

# videoErrorLoading
source: Error loading video: {reason}
ru: Ошибка загрузки видео: {reason}

# videoUrlNotSupported
source: Video URL is not set or not supported.
ru: Видео URL не задан или не поддерживается.

# videoLoadFailed
source: Failed to load video.
ru: Не удалось загрузить видео.

# authErrorGeneric
source: Authentication error. Please restart.
ru: Ошибка авторизации. Пожалуйста, перезапустите приложение.
